MAX_MESSAGES = 3
RATIO_LIMIT = 89
FLOOD_WARNING_MESSAGE = (
    "Привет, {}! Будем благодарны, если сделаете ваши "
    "сообщения в чате более разнообразными и креативными. Это сделает "
    "обсуждения интереснее для всех. Спасибо!"
)
OBSCENE_WARNING_MESSAGE = (
    "Привет, {}! Ваше последнее сообщение было автоматически удалено нашей "
    "системой. Причина: обнаружено использование нецензурной лексики. Мы "
    "уважительно относимся к каждому участнику общения и стремимся "
    "поддерживать дружелюбную атмосферу. Просим вас соблюдать установленные "
    "правила и воздерживаться от использования нецензурной и оскорбительной "
    "лексики.\nСпасибо за понимание!"
)
