START_MESSAGE = 'Здесь должно быть приветственное сообщение (Заглушка)!'
WELCOME_MESSAGE = (
    'Добро пожаловать {}, в группу по реабилитации '
    '<a href="https://rsmu.ru/index.php?id=1313">РНИМУ</a> и благотворительного фонда '
    '<a href="https://bfkh.ru/">Фонд Хабенского</a>, посвященное реабилитации!\n'
    'Здесь вы найдете единомышленников, которые также заинтересованы в помощи детям, молодым и взрослым с '
    'онкологическими и другими серьезными заболеваниями головного и спинного мозга. '
)
REGEX_NON_LATIN = r"^[^a-zA-Z]*$"
